In [2]:
import pandas as pd

In [3]:
print("hello world")

hello world

In [4]:
df = pd.read_csv("final_cleaned.csv", sep=",")

In [5]:
df.head()

,code_comptable,code_postal,address,latitude,longitude,wilaya
0,1101,1016.0,ADRAR KSAR ADGHA,29.262951,-0.222040,1
1,1206,1011.0,DAIRA TSABIT,28.308039,-0.240628,1
2,1300,1004.0,DAIRA REGGANE CENTRE,26.717489,-0.193939,1
3,1303,1009.0,APC SALI,26.961252,-0.025155,1
4,2100,2000.0,RUE DU 20 AOUT,36.284248,1.558910,2

In [6]:
df.columns  # get the column names

Index(['code_comptable', 'code_postal', 'address', 'latitude', 'longitude',
       'wilaya'],
      dtype='object')

In [7]:
df.index.tolist()  # get the index as a list

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102,
 103,
 104,
 105,
 106,
 107,
 108,
 109,
 110,
 111,
 112,
 113,
 114,
 115,
 116,
 117,
 118,
 119,
 120,
 121,
 122,
 123,
 124,
 125,
 126,
 127,
 128,
 129,
 130,
 131,
 132,
 133,
 134,
 135,
 136,
 137,
 138,
 139,
 140,
 141,
 142,
 143,
 144,
 145,
 146,
 147,
 148,
 149,
 150,
 151,
 152,
 153,
 154,
 155,
 156,
 157,
 158,
 159,
 160,
 161,
 162,
 163,
 164,
 165,
 166,
 167,
 168,
 169,
 170,
 171,
 172,
 173,
 174,
 175,
 176,
 177,
 178,
 179,
 180,
 181,
 182,
 183,
 184,
 185,
 186,
 187,
 188,
 189,
 190,
 191,
 192,
 193,
 194,
 195,
 196,
 197,
 198,
 199,
 200,
 201,
 202,
 203,
 204,
 205,
 206,
 207,
 208,
 209,
 210,
 211,
 212,
 213,
 214,
 215,
 216,
 217,
 218,
 219,
 220,
 221,
 222,
 223,
 224,
 225,
 226,
 227,
 228,
 229,
 230,
 231,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 239,
 240,
 241,
 242,
 243,
 244,
 245,
 246,
 247,
 248,
 249,
 250,
 251,
 252,
 253,
 254,
 255,
 256,
 257,
 258,
 259,
 260,
 261,
 262,
 263,
 264,
 265,
 266,
 267,
 268,
 269,
 270,
 271,
 272,
 273,
 274,
 275,
 276,
 277,
 278,
 279,
 280,
 281,
 282,
 283,
 284,
 285,
 286,
 287,
 288,
 289,
 290,
 291,
 292,
 293,
 294,
 295,
 296,
 297,
 298,
 299,
 300,
 301,
 302,
 303,
 304,
 305,
 306,
 307,
 308,
 309,
 310,
 311,
 312,
 313,
 314,
 315,
 316,
 317,
 318,
 319,
 320,
 321,
 322,
 323,
 324,
 325,
 326,
 327,
 328,
 329,
 330,
 331,
 332,
 333,
 334,
 335,
 336,
 337,
 338,
 339,
 340,
 341,
 342,
 343,
 344,
 345,
 346,
 347,
 348,
 349,
 350,
 351,
 352,
 353,
 354,
 355,
 356,
 357,
 358,
 359,
 360,
 361,
 362,
 363,
 364,
 365,
 366,
 367,
 368,
 369,
 370,
 371,
 372,
 373,
 374,
 375,
 376,
 377,
 378,
 379,
 380,
 381,
 382,
 383,
 384,
 385,
 386,
 387,
 388,
 389,
 390,
 391,
 392,
 393,
 394,
 395,
 396,
 397,
 398,
 399,
 400,
 401,
 402,
 403,
 404,
 405,
 406,
 407,
 408,
 409,
 410,
 411,
 412,
 413,
 414,
 415,
 416,
 417,
 418,
 419,
 420,
 421,
 422,
 423,
 424,
 425,
 426,
 427,
 428,
 429,
 430,
 431,
 432,
 433,
 434,
 435,
 436,
 437,
 438,
 439,
 440,
 441,
 442,
 443,
 444,
 445,
 446,
 447,
 448,
 449,
 450,
 451,
 452,
 453,
 454,
 455,
 456,
 457,
 458,
 459,
 460,
 461,
 462,
 463,
 464,
 465,
 466,
 467,
 468,
 469,
 470,
 471,
 472,
 473,
 474,
 475,
 476,
 477,
 478,
 479,
 480,
 481,
 482,
 483,
 484,
 485,
 486,
 487,
 488,
 489,
 490,
 491,
 492,
 493,
 494,
 495,
 496,
 497,
 498,
 499,
 500,
 501,
 502,
 503,
 504,
 505,
 506,
 507,
 508,
 509,
 510,
 511,
 512,
 513,
 514,
 515,
 516,
 517,
 518,
 519,
 520,
 521,
 522,
 523,
 524,
 525,
 526,
 527,
 528,
 529,
 530,
 531,
 532,
 533,
 534,
 535,
 536,
 537,
 538,
 539,
 540,
 541,
 542,
 543,
 544,
 545,
 546,
 547,
 548,
 549,
 550,
 551,
 552,
 553,
 554,
 555,
 556,
 557,
 558,
 559,
 560,
 561,
 562,
 563,
 564,
 565,
 566,
 567,
 568,
 569,
 570,
 571,
 572,
 573,
 574,
 575,
 576,
 577,
 578,
 579,
 580,
 581,
 582,
 583,
 584,
 585,
 586,
 587,
 588,
 589,
 590,
 591,
 592,
 593,
 594,
 595,
 596,
 597,
 598,
 599,
 600,
 601,
 602,
 603,
 604,
 605,
 606,
 607,
 608,
 609,
 610,
 611,
 612,
 613,
 614,
 615,
 616,
 617,
 618,
 619,
 620,
 621,
 622,
 623,
 624,
 625,
 626,
 627,
 628,
 629,
 630,
 631,
 632,
 633,
 634,
 635,
 636,
 637,
 638,
 639,
 640,
 641,
 642,
 643,
 644,
 645,
 646,
 647,
 648,
 649,
 650,
 651,
 652,
 653,
 654,
 655,
 656,
 657,
 658,
 659,
 660,
 661,
 662,
 663,
 664,
 665,
 666,
 667,
 668,
 669,
 670,
 671,
 672,
 673,
 674,
 675,
 676,
 677,
 678,
 679,
 680,
 681,
 682,
 683,
 684,
 685,
 686,
 687,
 688,
 689,
 690,
 691,
 692,
 693,
 694,
 695,
 696,
 697,
 698,
 699,
 700,
 701,
 702,
 703,
 704,
 705,
 706,
 707,
 708,
 709,
 710,
 711,
 712,
 713,
 714,
 715,
 716,
 717,
 718,
 719,
 720,
 721,
 722,
 723,
 724,
 725,
 726,
 727,
 728,
 729,
 730,
 731,
 732,
 733,
 734,
 735,
 736,
 737,
 738,
 739,
 740,
 741,
 742,
 743,
 744,
 745,
 746,
 747,
 748,
 749,
 750,
 751,
 752,
 753,
 754,
 755,
 756,
 757,
 758,
 759,
 760,
 761,
 762,
 763,
 764,
 765,
 766,
 767,
 768,
 769,
 770,
 771,
 772,
 773,
 774,
 775,
 776,
 777,
 778,
 779,
 780,
 781,
 782,
 783,
 784,
 785,
 786,
 787,
 788,
 789,
 790,
 791,
 792,
 793,
 794,
 795,
 796,
 797,
 798,
 799,
 800,
 801,
 802,
 803,
 804,
 805,
 806,
 807,
 808,
 809,
 810,
 811,
 812,
 813,
 814,
 815,
 816,
 817,
 818,
 819,
 820,
 821,
 822,
 823,
 824,
 825,
 826,
 827,
 828,
 829,
 830,
 831,
 832,
 833,
 834,
 835,
 836,
 837,
 838,
 839,
 840,
 841,
 842,
 843,
 844,
 845,
 846,
 847,
 848,
 849,
 850,
 851,
 852,
 853,
 854,
 855,
 856,
 857,
 858,
 859,
 860,
 861,
 862,
 863,
 864,
 865,
 866,
 867,
 868,
 869,
 870,
 871,
 872,
 873,
 874,
 875,
 876,
 877,
 878,
 879,
 880,
 881,
 882,
 883,
 884,
 885,
 886,
 887,
 888,
 889,
 890,
 891,
 892,
 893,
 894,
 895,
 896,
 897,
 898,
 899,
 900,
 901,
 902,
 903,
 904,
 905,
 906,
 907,
 908,
 909,
 910,
 911,
 912,
 913,
 914,
 915,
 916,
 917,
 918,
 919,
 920,
 921,
 922,
 923,
 924,
 925,
 926,
 927,
 928,
 929,
 930,
 931,
 932,
 933,
 934,
 935,
 936,
 937,
 938,
 939,
 940,
 941,
 942,
 943,
 944,
 945,
 946,
 947,
 948,
 949,
 950,
 951,
 952,
 953,
 954,
 955,
 956,
 957,
 958,
 959,
 960,
 961,
 962,
 963,
 964,
 965,
 966,
 967,
 968,
 969,
 970,
 971,
 972,
 973,
 974,
 975,
 976,
 977,
 978,
 979,
 980,
 981,
 982,
 983,
 984,
 985,
 986,
 987,
 988,
 989,
 990,
 991,
 992,
 993,
 994,
 995,
 996,
 997,
 998,
 999,
 ...]

In [8]:
# convert index values to strings and prefix each with "A"
df.index = "A" + df.index.astype(str)  # change index to strings with "A" prefix

In [9]:
df.index.tolist()[:12]   # displa the first 12 index values

['A0', 'A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'A9', 'A10', 'A11']

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2749 entries, A0 to A2748
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   code_comptable  2749 non-null   int64
 1   code_postal     2749 non-null   float64
 2   address         2749 non-null   object
 3   latitude        2749 non-null   float64
 4   longitude       2749 non-null   float64
 5   wilaya          2749 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 150.3+ KB

In [11]:
df.describe()

       code_comptable   code_postal     latitude    longitude       wilaya
count     2749.000000   2749.000000  2749.000000  2749.000000  2749.000000
mean     23947.271008  23659.587486    35.531818     3.536211    23.612950
std      14414.220023  14436.687447     1.842982     2.851483    14.444117
min       1101.000000   1002.000000    19.954191    -8.147782     1.000000
25%      12108.000000  12003.000000    35.336102     1.366400    12.000000
50%      22207.000000  22028.000000    36.080727     3.623000    22.000000
75%      35305.000000  35023.000000    36.442158     5.745250    35.000000
max      58403.000000  58034.000000    37.651378    12.604397    58.000000

In [12]:
df.nunique() # get the number of unique values in each column

code_comptable    2749
code_postal       2749
address           2710
latitude          2647
longitude         2706
wilaya              58
dtype: int64

In [13]:
df["address"].nunique()  # get the number of unique values in the 'address' column

2710

In [14]:
df.shape  # get the shape of the DataFrame

(2749, 6)

In [15]:
df.size  # get the total number of elements in the DataFrame

16494

In [16]:
#other formats in data sector are not only csv but also excel, json, sql, parquet, html, feather ...   
#df.to_excel("final_cleaned.xlsx", index=False)  # save DataFrame to Excel file index false means to  Write row names
df.to_json("final_cleaned.json", orient="records", lines=True)  # save  DataFrame to JSON file orient and lines for better structure
#df.to_parquet("final_cleaned.parquet", index=False)  # save DataFrame to Parquet file
df.to_html("final_cleaned.html", index=False)  # save DataFrame to HTML

#Note : to_excel and to_parquet may require additional libraries like openpyxl or pyarrow to be installed

# parquet and feather are more efficient for large datasets compared to csv and excel files due to their binary format and better compression they take less storage space and offer faster read/write operations

In [17]:
dfJson = pd.read_json("final_cleaned.json", lines=True)  # read the JSON file back into a DataFrame
dfJson.head()  # display the first few rows of the DataFrame

,code_comptable,code_postal,address,latitude,longitude,wilaya
0,1101,1016,ADRAR KSAR ADGHA,29.262951,-0.222040,1
1,1206,1011,DAIRA TSABIT,28.308039,-0.240628,1
2,1300,1004,DAIRA REGGANE CENTRE,26.717489,-0.193939,1
3,1303,1009,APC SALI,26.961252,-0.025155,1
4,2100,2000,RUE DU 20 AOUT,36.284248,1.558910,2

In [18]:
df.sample(20, random_state=1) # display 20 random rows from the DataFrame random_state for reproducibility which means same random rows each time if we dont set it we will get different random rows each time

,code_comptable,code_postal,address,latitude,longitude,wilaya
A1695,45208,45016.0,"QUARTIER ESSALEM, MECHERIA",33.541065,0.273575,45
A1032,44323,44014.0,HAY SOUAMAA,36.264400,2.215970,44
A2010,10225,10093.0,TIKSIRIDENE 10194,36.401100,4.307800,10
A1443,21512,21020.0,OUM-TOUB,36.689449,6.573111,21
A428,21520,21004.0,RAMDANE-DJAMEL,36.752731,6.897642,21
A1471,10211,10073.0,MERKALLA 10168,36.430199,3.986400,10
A1292,5104,5040.0,BATNA CITE KECHIDA,35.334095,6.092417,5
A802,46404,46010.0,RUE BOUCHEKIF BOUMAZA,35.206161,-1.375125,46
A586,31201,31108.0,AEROPORT ES SENIA - ORAN,35.622784,-0.592565,31
A2362,24321,24051.0,CITE BOUDAROUA O/FRAGHA,36.523590,7.706260,24
A65,5106,5006.0,FRERES BOUABSA BATNA,35.331661,6.103865,5
A1496,9104,9018.0,CITE LE PLAN ZABANA,36.284191,2.481390,9
A2137,29409,29072.0,RUE DE LA MOSQUE SOUIHIA,35.387367,0.370275,29
A480,24310,24027.0,RUE MERRAH ABDALLAH,36.610958,7.511400,24
A2250,46221,46041.0,CITE HOUARI BOUMEDIENE,35.325455,-1.105086,46
A1221,15504,15057.0,BUREAU DE POSTE OUADHIA,36.332150,4.519140,15
A1193,26703,26018.0,EL AZIZIA CENTRE,36.162907,2.430089,26
A1301,32101,32010.0,CITE EL GRABA RUE DES FEDAYEEN,36.168129,1.337427,32
A965,30112,30034.0,CITE SIDI AMRANE MEKHADMA,35.203928,-0.634742,30
A1466,36209,36043.0,OUED EL HOUT,36.822544,8.503491,36

In [ ]:
"""
loc enables label-based indexing, allowing you to access rows and columns by their labels.
iloc enables integer-based indexing, allowing you to access rows and columns by their integer positions
syntax
df.loc[row_labels, column_labels]
df.iloc[row_indices, column_indices]
"""

In [22]:
df.loc["A480"]

code_comptable                  24310
code_postal                   24027.0
address           RUE MERRAH ABDALLAH
latitude                    36.610958
longitude                      7.5114
wilaya                             24
Name: A480, dtype: object

In [23]:
df.loc["A100":"A110", ["address", "wilaya"]]

                                              address  wilaya
A100                                     AOKAS CENTRE       6
A101                                 OUED GHIR CENTRE       6
A102                                       TALA HAMZA       6
A103  RUE  ABDELKADER  SAHNOUNE   N째 12  AKBOU CENTRE       6
A104                                BOUDJELLIL CENTRE       6
A105                                 GUENDOUZE CENTRE       6
A106                                 IGHIL ALI CENTRE       6
A107                                   IGHER AMOKRANE       6
A108          RUE PRINCIPALE ABDERRAHMANE MIRA  06006       6
A109                BOULEVARD  1er NOV N째 226  AKBOU        6
A110                                  BARBACHA CENTRE       6

In [24]:
df.loc[["A50", "A150", "A250"], ["address", "wilaya"]]

                 address  wilaya
A50            EL-GHICHA       3
A150    ZONE BLEU BECHAR       8
A250  RUE BENAICHA AHMED      14

In [26]:
df.loc[:, "code_comptable"]

A0        1101
A1        1206
A2        1300
A3        1303
A4        2100
         ...
A2744    50318
A2745    41319
A2746    32314
A2747    13710
A2748    26615
Name: code_comptable, Length: 2749, dtype: int64

In [27]:
df.loc["A10", "address"]  # access the 'address' of the row with index label 'A10'

'CITE DES FONCTIONNAIRES,CHLEF CENTRE'

In [28]:
df.iloc[10]  # access the 11th row (index position 10)

code_comptable                                    2122
code_postal                                     2094.0
address           CITE DES FONCTIONNAIRES,CHLEF CENTRE
latitude                                     36.169701
longitude                                       1.3407
wilaya                                               2
Name: A10, dtype: object

In [32]:
df.iloc[458:470, 2:5]  # access rows 0-11 and columns 2-4

                             address   latitude  longitude
A458            AVENUE TABET HOCINE   36.913639   7.673053
A459                      VSA TREAT   36.899006   7.427666
A460     RUE EL MOKHERANI AIN BERDA   36.647797   7.590952
A461                LA POSTE CHEURFA  36.720718   7.553905
A462        CITE 19 JUIN  SIDI AMAR   36.813705   7.710182
A463              CITE OUED EL HOUT   36.737865   7.465076
A464               CITE HADJAR EDISS  36.790482   7.623020
A465                 CITE  BELLEVUE   36.855202   7.750871
A466     CITE  800 LOGTS  -BOUKHADRA  36.874321   7.744382
A467     CITE DES ORANGERS  EL BOUNI  36.851788   7.742497
A468  CITE FADILA SAADANE- EL HADJAR  36.802109   7.735362
A469       CITE MOHAMED TAHAR SERIDI  36.463039   7.431370

In [ ]:
wilaya_map = {
    1: "Adrar", 2: "Chlef", 3: "Laghouat", 4: "Oum El Bouaghi", 5: "Batna",
    6: "B챕ja챦a", 7: "Biskra", 8: "B챕char", 9: "Blida", 10: "Bouira",
    11: "Tamanrasset", 12: "T챕bessa", 13: "Tlemcen", 14: "Tiaret", 15: "Tizi Ouzou",
    16: "Alger", 17: "Djelfa", 18: "Jijel", 19: "S챕tif", 20: "Sa챦da",
    21: "Skikda", 22: "Sidi Bel Abb챔s", 23: "Annaba", 24: "Guelma", 25: "Constantine",
    26: "M챕d챕a", 27: "Mostaganem", 28: "M'Sila", 29: "Mascara", 30: "Ouargla",
    31: "Oran", 32: "El Bayadh", 33: "Illizi", 34: "Bordj Bou Arr챕ridj", 35: "Boumerd챔s",
    36: "El Tarf", 37: "Tindouf", 38: "Tissemsilt", 39: "El Oued", 40: "Khenchela",
    41: "Souk Ahras", 42: "Tipaza", 43: "Mila", 44: "A챦n Defla", 45: "Na창ma",
    46: "A챦n T챕mouchent", 47: "Gharda챦a", 48: "Relizane", 49: "Timimoun",
    50: "Bordj Badji Mokhtar", 51: "Ouled Djellal", 52: "B챕ni Abb챔s", 53: "In Salah",
    54: "In Guezzam", 55: "Touggourt", 56: "Djanet", 57: "El M'Ghair", 58: "El Meniaa"
}

In [45]:
df["wilaya_name"] = df["wilaya"] # create a new column 'wilaya_name' copying values from 'wilaya' column

In [ ]:
df.loc[:,"wilaya_name"] = df["wilaya_name"].map(wilaya_map) # map wilaya codes to names using wilaya_map dictionary 
# its like saying for each value in 'wilaya' column look it up in wilaya_map and get the corresponding name
# we could've done it more directly like so : df["wilaya_name"] = df["wilaya"].map(wilaya_map)

In [49]:
df.head()

,code_comptable,code_postal,address,latitude,longitude,wilaya,wilaya_name
A0,1101,1016.0,ADRAR KSAR ADGHA,29.262951,-0.222040,1,Adrar
A1,1206,1011.0,DAIRA TSABIT,28.308039,-0.240628,1,Adrar
A2,1300,1004.0,DAIRA REGGANE CENTRE,26.717489,-0.193939,1,Adrar
A3,1303,1009.0,APC SALI,26.961252,-0.025155,1,Adrar
A4,2100,2000.0,RUE DU 20 AOUT,36.284248,1.558910,2,Chlef

In [60]:
df.sort_values(by="wilaya", ascending=False)  # sort DataFrame by 'wilaya' column
df.head(10)

,code_comptable,code_postal,address,latitude,longitude,wilaya,wilaya_name
A0,1101,1016.0,ADRAR KSAR ADGHA,29.262951,-0.222040,1,Adrar
A1,1206,1011.0,DAIRA TSABIT,28.308039,-0.240628,1,Adrar
A2,1300,1004.0,DAIRA REGGANE CENTRE,26.717489,-0.193939,1,Adrar
A3,1303,1009.0,APC SALI,26.961252,-0.025155,1,Adrar
A4,2100,2000.0,RUE DU 20 AOUT,36.284248,1.558910,2,Chlef
A5,2101,2005.0,HAY BENSOUNA,36.161701,1.320700,2,Chlef
A6,2102,2041.0,HAY SAHLI,36.175598,1.327700,2,Chlef
A7,2104,2042.0,HAY LALLA AOUDA,36.145802,1.323000,2,Chlef
A8,2105,2013.0,RUE DE LA RESISTANCE,36.163799,1.337100,2,Chlef
A9,2121,2091.0,HAY ES SALAM,36.156300,1.339900,2,Chlef

In [ ]:
df_sort_copy =df.sort_values(by=["wilaya", "address"], ascending=[0, 1])  # sort by 'wilaya' ascending and 'address' descending
# using ascending=[0, 1] is equivalent to ascending=[False, True]
df_sort_copy.head(10)

,code_comptable,code_postal,address,latitude,longitude,wilaya,wilaya_name
A1092,58400,58001.0,CENTRE VILLE EL MENIAA,33.330733,6.886294,58,El Meniaa
A948,58403,58034.0,CITE EL MENIAA PORT SAID EL MENIAA,36.360149,6.641592,58,El Meniaa
A880,58401,58008.0,QUARTIER HOFRET EL ABBAS EL MENIAA,27.876008,-0.287751,58,El Meniaa
A1094,57301,57045.0,CITE AIN CHEIKH,34.676832,3.241054,57,El M'Ghair
A1318,57306,57056.0,CITE EL-ARFIANE,33.639390,5.981870,57,El M'Ghair
A1994,57305,57057.0,CITE EL-BAADJ,34.209310,5.745250,57,El M'Ghair
A1328,57307,57067.0,M'RARA,33.476232,5.660677,57,El M'Ghair
A1494,57311,57038.0,SIDI KHELIL,33.838110,5.960399,57,El M'Ghair
A865,57312,57039.0,STILL,34.259187,5.914972,57,El M'Ghair
A1316,57315,57042.0,TENEDLA EL BERD,35.875410,7.113530,57,El M'Ghair

In [3]:
import pandas as pd
dfo =pd.read_csv("bios.csv", sep =",")

In [4]:
dfo.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-Fran챌ois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyr챕n챕es-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [ ]:
# select rows where height_cm > 220 (all columns) 
dfo.loc[dfo["height_cm"] > 220,:]
# dfo[dfo["height_cm"] > 220]   alternative syntax for the same operation

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5673,5696,Gunther Behnke,1963-01-19,Leverkusen,Nordrhein-Westfalen,GER,Germany,221.0,114.0,NaN
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
6978,7013,Arvydas Sabonis,1964-12-19,Kaunas,Kaunas,LTU,Lithuania Soviet Union,223.0,122.0,NaN
89070,89782,Yao Ming,1980-09-12,Xuhui District,Shanghai,CHN,People's Republic of China,226.0,141.0,NaN
89075,89787,Roberto Due챰as,1975-11-01,Madrid,Madrid,ESP,Spain,221.0,137.0,NaN
120266,122147,Zhang Zhaoxu,1987-11-18,Binzhou,Shandong,CHN,People's Republic of China,221.0,110.0,NaN

In [31]:
dfo.loc[(dfo["height_cm"] > 210) & (dfo["born_country"] == "USA"), :] # select rows where height_cm > 220 and born_country is ESP

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5681,5704,Walt Bellamy,1937-07-24,New Bern,North Carolina,USA,United States,211.0,98.0,2013-11-02
5781,5804,Tommy Burleson,1952-02-24,Crossnore,North Carolina,USA,United States,223.0,102.0,NaN
5894,5919,Mel Counts,1941-10-16,Coos Bay,Oregon,USA,United States,213.0,102.0,NaN
6106,6133,Marc Freiberger,1928-11-27,Amarillo,Texas,USA,United States,211.0,98.0,2005-06-29
6281,6309,Darrall Imhoff,1938-10-11,San Gabriel,California,USA,United States,211.0,98.0,2017-06-30
6379,6410,Joe Kleine,1962-01-04,Colorado Springs,Colorado,USA,United States,211.0,122.0,NaN
6393,6424,Jon Koncak,1963-05-17,Cedar Rapids,Iowa,USA,United States,213.0,113.0,NaN
6442,6473,Christian Laettner,1969-08-17,Angola,New York,USA,United States,211.0,107.0,NaN
6615,6648,Tom McMillen,1952-05-26,Mansfield,Pennsylvania,USA,United States,212.0,95.0,NaN
6722,6755,Shaquille O'Neal,1972-03-06,Newark,New Jersey,USA,United States,216.0,137.0,NaN
6937,6972,David Robinson,1965-08-06,Key West,Florida,USA,United States,216.0,107.0,NaN
7012,7048,Daniel Santiago,1976-06-24,Tarpon Springs,Florida,USA,Puerto Rico,213.0,111.0,NaN
112319,113575,Chris Kaman,1982-04-28,Wyoming,Michigan,USA,Germany,213.0,122.0,NaN
112366,113622,Dwight Howard,1985-12-08,Atlanta,Georgia,USA,United States,211.0,120.0,NaN
118573,120309,Al-Farouq Aminu,1990-09-21,Atlanta,Georgia,USA,Nigeria,211.0,98.0,NaN
123850,126093,Tyson Chandler,1982-10-02,Hanford,California,USA,United States,216.0,107.0,NaN
132188,135037,Domantas Sabonis,1996-05-03,Portland,Oregon,USA,Lithuania,211.0,109.0,NaN
133332,136271,DeAndre Jordan,1988-07-21,Houston,Texas,USA,United States,211.0,120.0,NaN
142044,145640,Jahlil Okafor,1995-12-15,Fort Smith,Arkansas,USA,Nigeria,211.0,NaN,NaN
142930,146560,Mike Tobey,1994-10-10,Monroe,New York,USA,Slovenia,213.0,NaN,NaN
143712,147367,JaVale McGee,1988-01-19,Flint,Michigan,USA,United States,213.0,NaN,NaN

In [34]:
dfo[dfo["name"].str.contains("Smith")].sample(7)  # select rows where 'name' contains 'Smith'

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
63225,63695,Gary Smith,1952-06-26,NaN,NaN,NaN,Australia,NaN,NaN,NaN
64318,64800,Dean Smith,1967-11-01,Canberra,Australian Capital Territory,AUS,Australia,182.0,82.0,NaN
68266,68783,Anne Smith,1941-08-31,Amersham,England,GBR,Great Britain,170.0,66.0,1993-11-09
114234,115541,Pieter Smith,1987-04-03,Upington,Northern Cape,RSA,South Africa,192.0,75.0,NaN
45530,45875,Susan Smith,1950-12-07,Edmonton,Alberta,CAN,Canada,164.0,59.0,NaN
51209,51568,Lester Smith,1902-04-14,San Francisco,California,USA,United States,178.0,NaN,1957-09-04
9728,9783,Kevin Smith,1961-03-22,Stockton-on-Tees,England,GBR,Great Britain,185.0,85.0,NaN

In [44]:
dfo[(dfo["born_country"].isin(["USA", "CAN", "MEX"]) ) & (dfo.height_cm > 190) & (dfo.weight_kg.notna()) ]  # select rows where 'born_country' is in the specified list

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
751,755,S챕bastien LeBlanc,1973-12-27,Montr챕al,Qu챕bec,CAN,Canada,193.0,82.0,NaN
1135,1142,Jean-Fran챌ois Bergeron,1973-06-26,Saint-J챕r척me,Qu챕bec,CAN,Canada,195.0,100.0,NaN
2225,2235,Butch Johnson,1955-08-30,Worcester,Massachusetts,USA,United States,191.0,98.0,NaN
2712,2724,Lindsay Davenport,1976-06-08,Palos Verdes,California,USA,United States,191.0,79.0,NaN
2736,2748,Jim Butler,1971-02-15,Iowa City,Iowa,USA,United States,193.0,77.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143785,147441,Conor Harrity,1994-09-03,Boston,Massachusetts,USA,United States,193.0,94.0,NaN
143788,147444,Michael Grady,1996-10-22,Pittsburgh,Pennsylvania,USA,United States,196.0,91.0,NaN
143789,147445,Nick Mead,1995-03-12,Strafford,Pennsylvania,USA,United States,198.0,97.0,NaN
144005,147669,Ike Nwamu,1993-06-03,Greensboro,North Carolina,USA,Nigeria,196.0,92.0,NaN
144404,148094,Sipulaoer Ruian,1993-01-13,Mississauga,Ontario,CAN,People's Republic of China,193.0,93.0,NaN

In [46]:
dfo.query("height_cm > 200 and born_country == 'USA' and weight_kg.notna()")  # select rows where height_cm > 200 and born_country is USA using query method

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5197,5216,Anne Donovan,1961-11-01,Ridgewood,New Jersey,USA,United States,203.0,62.0,2018-06-13
5652,5675,Mike Bantom,1951-12-03,Philadelphia,Pennsylvania,USA,United States,203.0,93.0,NaN
5657,5680,Jim Barnes,1941-04-13,Tuckerman,Arkansas,USA,United States,201.0,109.0,2002-09-14
5681,5704,Walt Bellamy,1937-07-24,New Bern,North Carolina,USA,United States,211.0,98.0,2013-11-02
5709,5732,Larry Bird,1956-12-07,French Lick,Indiana,USA,United States,205.0,100.0,NaN
...,...,...,...,...,...,...,...,...,...,...
142042,145637,Chimezie Metu,1997-03-22,Los Angeles,California,USA,Nigeria,206.0,102.0,NaN
142043,145638,Ekpe Udoh,1987-05-20,Edmond,Oklahoma,USA,Nigeria,208.0,111.0,NaN
143706,147361,Bam Adebayo,1997-07-18,Newark,New Jersey,USA,United States,206.0,116.0,NaN
143707,147362,Jerami Grant,1994-03-12,Portland,Oregon,USA,United States,203.0,95.0,NaN
143710,147365,Khris Middleton,1991-08-12,Charleston,South Carolina,USA,United States,201.0,101.0,NaN

In [49]:
dfo[dfo["name"].str.contains("grant|smith", case=False)] # this is a regex expression

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
46,47,Gladys Eastlake-Smith,1883-08-14,Lewisham,England,GBR,Great Britain,NaN,NaN,1941-09-18
68,69,Sam Smith,1971-11-27,Epping,England,GBR,Great Britain,175.0,62.0,NaN
302,303,Grant Greenham,1954-07-20,Perth,Western Australia,AUS,Australia,NaN,NaN,2018-08-23
363,364,Mary Grant,1949-02-27,Windsor,Ontario,CAN,Canada,169.0,NaN,NaN
659,662,Roger Smith,1964-01-20,Freeport,City of Freeport,BAH,The Bahamas,185.0,79.0,NaN
...,...,...,...,...,...,...,...,...,...,...
143707,147362,Jerami Grant,1994-03-12,Portland,Oregon,USA,United States,203.0,95.0,NaN
143816,147472,Kieran Smith,2000-05-20,NaN,NaN,NaN,United States,NaN,NaN,NaN
144288,147976,Alex Grant,1989-01-20,Antigonish,Nova Scotia,CAN,Canada,188.0,NaN,NaN
144656,148352,Grant Hardie,1992-03-27,Dumfries,Scotland,GBR,Great Britain,NaN,NaN,NaN
145421,149144,Nathan Smith,1998-10-19,Tampa,Florida,USA,United States,NaN,NaN,NaN

In [51]:
dfo.sort_values(by="height_cm" , ascending=True).head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
28619,28832,Rosario Briones,1953-10-05,San Luis Potos챠,San Luis Potos챠,MEX,Mexico,127.0,42.0,NaN
4515,4530,Lyton Mphande,1963-05-14,NaN,NaN,NaN,Malawi,127.0,62.0,NaN
4516,4531,Helman Palije,1967-06-24,NaN,NaN,NaN,Malawi,128.0,74.0,NaN
4664,4681,Salvador Miranda,1949-09-13,NaN,NaN,NaN,Nicaragua,130.0,51.0,NaN
4517,4532,Boston Simbeye,1959-12-24,NaN,NaN,NaN,Malawi,130.0,67.0,NaN

In [53]:
dfo["is_died_date_null"] = dfo["died_date"].isnull()  # create a new boolean column indicating if 'died_date' is null

In [54]:
dfo.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,is_died_date_null
0,1,Jean-Fran챌ois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,False
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,True
2,3,Jean Borotra,1898-08-13,Biarritz,Pyr챕n챕es-Atlantiques,FRA,France,183.0,76.0,1994-07-17,False
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,False
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,False

In [ ]:
dfo_copy = dfo.copy()  # create a copy of the DataFrame to avoid SettingWithCopyWarning
# when we doon't use .copy for creating a copy of dfo both will point to the same place in the memory so if we perform an action on one the other with have the concequencies too
dfo.drop(columns=["is_died_date_null"], inplace= True)

In [64]:
dfo_copy.columns

Index(['athlete_id', 'name', 'born_date', 'born_city', 'born_region',
       'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date',
       'is_died_date_null'],
      dtype='object')

In [65]:
dfo.columns

Index(['athlete_id', 'name', 'born_date', 'born_city', 'born_region',
       'born_country', 'NOC', 'height_cm', 'weight_kg', 'died_date'],
      dtype='object')

In [66]:
dfo_copy.rename(columns={"is_died_date_null": "died_date_null"}, inplace=True)

In [ ]:
import numpy as np
dfo_copy["born_country"] = np.where(dfo_copy["born_country"] == "FRA","Fr", dfo_copy["born_country"])  # replace 'FRA' with 'Fr' in 'born_country' column 
# it is equivalent in pandas to dfo_copy["born_country"] = dfo_copy["born_country"].where(dfo_copy["born_country"] != "FRA", "Fr")

# or more clean dfo_copy["born_country"] = dfo_copy["born_country"].replace("FRA", "Fr")

In [89]:
dfo_copy.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,died_date_null
0,1,Jean-Fran챌ois Blanchy,1886-12-12,Bordeaux,Gironde,Fr,France,NaN,NaN,1960-10-02,False
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,Fr,France,183.0,76.0,NaN,True
2,3,Jean Borotra,1898-08-13,Biarritz,Pyr챕n챕es-Atlantiques,Fr,France,183.0,76.0,1994-07-17,False
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,Fr,France,168.0,64.0,1978-03-20,False
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,False